# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [18]:
import pandas as pd
import random

def rand_list( a,b,lenght):
    li = list()
    for i in range(lenght):
        li.append(random.randint(a,b))
    return li

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [24]:
first = pd.Series(rand_list(1, 4, 100), name='first')
second = pd.Series(rand_list(1, 3, 100), name='second')
third = pd.Series(rand_list(10000, 30000 , 100), name='second')

### Step 3. Let's create a DataFrame by joinning the Series by column

In [28]:
grouped = pd.DataFrame({'first': first, 'second': second, 'third': third})
grouped.head()

   first  second  third
0      1       1  28540
1      3       1  10156
2      2       1  24977
3      2       2  16877
4      1       3  18697

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [31]:
grouped.columns = ['bedrs','bathrs','price_sqr_meter']
grouped.columns

Index(['bedrs', 'bathrs', 'price_sqr_meter'], dtype='object')

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [36]:
bigdframe = pd.DataFrame({'bigcolumn':first, 'bigcolumn':second, 'bigcolumn':third})

### Step 6. Ops it seems it is going only until index 99. Is it true? Yes

In [70]:
bigSerie = pd.concat([first, second, third])
bigdframe = pd.DataFrame({'bigcolumn':bigSerie})
bigdframe.tail()

    bigcolumn
95      10166
96      17265
97      26669
98      15301
99      21821

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [66]:
bigSerie = pd.concat([first, second, third], ignore_index=True)
bigdframe = pd.DataFrame({'bigcolumn':bigSerie})

In [68]:
bigdframe.tail()

     bigcolumn
295      10166
296      17265
297      26669
298      15301
299      21821